In [1]:
import pandas as pd
import numpy as np

In [2]:
file_salary = "../Resource/indeed_job_dataset.csv"

In [3]:
salary_df = pd.read_csv(file_salary)
salary_df.head()

,Unnamed: 0,Job_Title,Link,Queried_Salary,Job_Type,Skill,No_of_Skills,Company,No_of_Reviews,No_of_Stars,Date_Since_Posted,Description,Location,Company_Revenue,Company_Employees,Company_Industry
0,0,Data Scientist,https://www.indeed.com/rc/clk?jk=6a105f495c36a...,<80000,data_scientist,"['SAP', 'SQL']",2,Express Scripts,3301.0,3.3,1.0,"[<p><b>POSITION SUMMARY</b></p>, <p>\r\r\nThe ...",MO,More than $10B (USD),"10,000+",Health Care
1,1,Data Scientist,https://www.indeed.com/rc/clk?jk=86afd561ea8c6...,<80000,data_scientist,"['Machine Learning', 'R', 'SAS', 'SQL', 'Python']",5,Money Mart Financial Services,NaN,NaN,15.0,"[<p><b>What do we need?</b></p>, <ul><li>\r\r\...",TX,NaN,NaN,NaN
2,2,Data Scientist,https://www.indeed.com/rc/clk?jk=e0aad317e6d45...,<80000,data_scientist,"['Data Mining', 'Data Management', 'R', 'SAS',...",9,comScore,62.0,3.5,1.0,"[<ul><li>Validate, analyze, and conduct statis...",OR,NaN,NaN,NaN
3,3,Graduate Studies Program - Data Scientist,https://www.indeed.com/rc/clk?jk=1cfdd9e391a63...,<80000,data_scientist,['Certified Internal Auditor'],1,Central Intelligence Agency,158.0,4.3,30.0,"[<p>Full time</p>, <p>Washington, DC metro are...",DC,NaN,NaN,Government
4,4,Data Scientist I,https://www.indeed.com/rc/clk?jk=fec647775a21e...,<80000,data_scientist,"['Statistical Software', 'Time Management', 'R...",7,Federal Reserve Bank of Dallas,495.0,4.1,30.0,[<ul><li>Assist in consultations with business...,TX,NaN,"Less than 10,000",Banks and Financial Services

In [4]:
salary_df.columns

Index(['Unnamed: 0', 'Job_Title', 'Link', 'Queried_Salary', 'Job_Type',
       'Skill', 'No_of_Skills', 'Company', 'No_of_Reviews', 'No_of_Stars',
       'Date_Since_Posted', 'Description', 'Location', 'Company_Revenue',
       'Company_Employees', 'Company_Industry'],
      dtype='object')

In [5]:
salary_df = salary_df[['Job_Title','Queried_Salary','Job_Type','Skill','Company',
                                  'Location','Company_Industry']]
salary_df

,Job_Title,Queried_Salary,Job_Type,Skill,Company,Location,Company_Industry
0,Data Scientist,<80000,data_scientist,"['SAP', 'SQL']",Express Scripts,MO,Health Care
1,Data Scientist,<80000,data_scientist,"['Machine Learning', 'R', 'SAS', 'SQL', 'Python']",Money Mart Financial Services,TX,NaN
2,Data Scientist,<80000,data_scientist,"['Data Mining', 'Data Management', 'R', 'SAS',...",comScore,OR,NaN
3,Graduate Studies Program - Data Scientist,<80000,data_scientist,['Certified Internal Auditor'],Central Intelligence Agency,DC,Government
4,Data Scientist I,<80000,data_scientist,"['Statistical Software', 'Time Management', 'R...",Federal Reserve Bank of Dallas,TX,Banks and Financial Services
...,...,...,...,...,...,...,...
5710,Senior Data Engineer,>160000,data_engineer,"['Hive', 'Hadoop', 'Oracle', 'SQL', 'HBase', '...",Intelliswift Software Inc,NaN,NaN
5711,"Principal Data Engineer (Java, Spark, Storm, AWS)",>160000,data_engineer,"['Network', 'Scala', 'Kafka', 'Java', 'MongoDB...",Jobspring Partners,CA,Human Resources and Staffing
5712,Executive Director- Architect: Data Engineerin...,>160000,data_engineer,"['Spring', 'Data Management', 'Hadoop', 'Kafka...",JPMorgan Chase,DE,Banks and Financial Services
5713,"Senior Manager, Data Engineering (hands on)",>160000,data_engineer,"['Spring', 'Ruby', 'Test Automation', 'Scripti...",Capital One,NY,Banks and Financial Services
5714,Principal Visual Analytics / Big Data Engineer...,>160000,data_engineer,"['JavaScript', 'TS/SCI Clearance', 'XML', 'Had...",SAIC,MD,Aerospace and Defense

In [6]:
salary_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5715 entries, 0 to 5714
Data columns (total 7 columns):
Job_Title           5715 non-null object
Queried_Salary      5715 non-null object
Job_Type            5715 non-null object
Skill               5483 non-null object
Company             5611 non-null object
Location            5463 non-null object
Company_Industry    3826 non-null object
dtypes: object(7)
memory usage: 312.7+ KB

In [7]:
salary_df.count()

Job_Title           5715
Queried_Salary      5715
Job_Type            5715
Skill               5483
Company             5611
Location            5463
Company_Industry    3826
dtype: int64

In [8]:
salary_df['Skill'].isnull().sum()

232

In [9]:
salary_df['Location'].isnull().sum()

252

In [10]:

salary_df['Company'].isnull().sum()

104

In [11]:
salary_df['Skill'].replace('', np.nan, inplace=True)
salary_df['Company'].replace('', np.nan, inplace=True)
salary_df['Location'].replace('', np.nan, inplace=True)

In [12]:
salary_df.dropna(subset=['Skill','Location','Company'], inplace=True)

In [13]:
salary_df['Company_Industry'].isnull().sum()

1499

In [14]:
salary_df['Company_Industry'].fillna('Missln', inplace=True)

In [15]:
salary_df.count()

Job_Title           5166
Queried_Salary      5166
Job_Type            5166
Skill               5166
Company             5166
Location            5166
Company_Industry    5166
dtype: int64

In [16]:
salary_df["Job_Title"].value_counts()

#,"Location","Location","Company_Industry"

Data Scientist                                                     696
Data Analyst                                                       378
Data Engineer                                                      289
Senior Data Scientist                                              203
Senior Data Engineer                                               109
                                                                  ...
HBO Sr. Data Scientist/Lead Data Scientist                           1
Assistant Vice President, Data and Analytics, Strategy & Dis...      1
Data Analyst, Customer Support Operations                            1
General - NLP Scientist                                              1
Sr. Data Scientist - Engine Data Analytics                           1
Name: Job_Title, Length: 2149, dtype: int64

In [17]:
salary_df["Company_Industry"].value_counts()

Missln                                                             1499
Consulting and Business Services                                    708
Internet and Software                                               620
Banks and Financial Services                                        455
Health Care                                                         304
Insurance                                                           214
Industrial Manufacturing                                            144
Aerospace and Defense                                               127
Retail                                                              119
Education and Schools                                               108
Computers and Electronics                                            99
Consumer Goods and Services                                          97
Media, News and Publishing                                           95
Human Resources and Staffing                                         73
Telecommunications                                                   71
Government                                                           61
Pharmaceuticals                                                      53
Energy and Utilities                                                 45
Restaurants, Travel and Leisure                                      42
Auto                                                                 42
Transport and Freight                                                42
InsuranceHealth Care                                                 36
Real Estate                                                          24
Organization                                                         22
Food and Beverages                                                   18
Agriculture and Extraction                                           18
Construction                                                         14
RetailConsumer Goods and Services                                     6
Restaurants, Travel and LeisureConsulting and Business Services       3
Real EstateReal Estate                                                2
Industrial ManufacturingConsumer Goods and Services                   2
Food and BeveragesConsulting and Business Services                    1
Industrial ManufacturingAgriculture and Extraction                    1
Industrial ManufacturingConstruction                                  1
Name: Company_Industry, dtype: int64

In [18]:
salary_df = salary_df.replace(
    {"Industrial ManufacturingAgriculture and Extraction": "Industrial Manufacturing",
     "Industrial ManufacturingConstruction": "Industrial Manufacturing",
     "Industrial ManufacturingConsumer Goods and Services": "Industrial Manufacturing", 
     "Real EstateReal Estate": "Real Estate",
     "Restaurants, Travel and LeisureConsulting and Business Services": "Restaurants, Travel and Leisure",
     "Food and BeveragesConsulting and Business Services": "Food and Beverages",
     "RetailConsumer Goods and Services": "Consumer Goods and Services","InsuranceHealth Care": "Insurance",
    
    })
salary_df["Company_Industry"].value_counts()

Missln                              1499
Consulting and Business Services     708
Internet and Software                620
Banks and Financial Services         455
Health Care                          304
Insurance                            250
Industrial Manufacturing             148
Aerospace and Defense                127
Retail                               119
Education and Schools                108
Consumer Goods and Services          103
Computers and Electronics             99
Media, News and Publishing            95
Human Resources and Staffing          73
Telecommunications                    71
Government                            61
Pharmaceuticals                       53
Energy and Utilities                  45
Restaurants, Travel and Leisure       45
Auto                                  42
Transport and Freight                 42
Real Estate                           26
Organization                          22
Food and Beverages                    19
Agriculture and Extraction            18
Construction                          14
Name: Company_Industry, dtype: int64

In [19]:
skills = ['Python','SQL','Machine Learning',"R",'Hadoop',"Tableau",'SPSS','Data Mining','STATA','SPSS',
          'JavaScript','Power BI','Java','Business Intelligence']


def get_skills(skill):
    
    skill_counter=0

    for index,row in salary_df.iterrows():
    
        if skill in row["Skill"]:
            skill_counter += 1       
    
           # print(skill)
    
    return skill_counter

counter=0

total_skills = len(skills)


for skill in skills:
    
    counter_curr=counter+get_skills(skill)
    counter=0
    
    print(counter_curr)
    
#print(counter)

3089
3222
2228
2508
1538
1193
278
1046
90
278
276
169
1458
191

In [20]:
counter_python=0
counter_others=0
counter_sql =0
machine_learning_c=0
counter_r= 0
counter_hadoop=0
counter_tableau=0

for index,row in salary_df.iterrows():
    
    if "Python" in row["Skill"]:
        
        counter_python += 1
        
    elif "SQL" in row["Skill"]:
        
        counter_sql += 1 
    
    elif "Machine Learning" in row["Skill"]:
    
        machine_learning_c +=1
        
    elif 'R' in row['Skill']:
        
        counter_r += 1
        
    elif 'Hadoop' in row['Skill']:
        
        counter_hadoop += 1       
        
    elif 'Tableau' in row['Skill']:
        
        counter_tableau += 1
                 
    else:
        counter_others += 1
            
       
print(counter_python)
print(counter_sql)
print(machine_learning_c)
print(counter_r)
print(counter_hadoop)
print(counter_tableau)
print(counter_others)

In [21]:
salary_df["Python"] = ''
salary_df["SQL"] = ''
salary_df["Machine_Learning"] = ''
salary_df["R"] = ''
salary_df["Hadoop"] = ''
salary_df["Tableau"] = ''
salary_df["Others"] = ''


for index,row in salary_df.iterrows():
    
    if "Python" in row["Skill"]:
        row["Python"] = "True"
    elif 'SQL' in row["Skill"]:
        row['SQL'] = "True"
    elif 'Machine Learning' in row["Skill"]:
        row["Machine_Learning"] = "True"
    elif 'R' in row["Skill"]:
        row["R"] = "True"
    elif 'Hadoop' in row["Skill"]:
        row["Hadoop"] = "True"
    elif 'Tableau' in row["Skill"]:
        row["Tableau"] = "True"

    elif 'Others' in row["Skill"]:
        row['Others'] = "True"
        
salary_df.head()

,Job_Title,Queried_Salary,Job_Type,Skill,Company,Location,Company_Industry,Python,SQL,Machine_Learning,R,Hadoop,Tableau,Others
0,Data Scientist,<80000,data_scientist,"['SAP', 'SQL']",Express Scripts,MO,Health Care,,True,,,,,
1,Data Scientist,<80000,data_scientist,"['Machine Learning', 'R', 'SAS', 'SQL', 'Python']",Money Mart Financial Services,TX,Missln,True,,,,,,
2,Data Scientist,<80000,data_scientist,"['Data Mining', 'Data Management', 'R', 'SAS',...",comScore,OR,Missln,True,,,,,,
3,Graduate Studies Program - Data Scientist,<80000,data_scientist,['Certified Internal Auditor'],Central Intelligence Agency,DC,Government,,,,,,,
4,Data Scientist I,<80000,data_scientist,"['Statistical Software', 'Time Management', 'R...",Federal Reserve Bank of Dallas,TX,Banks and Financial Services,,,,True,,,

In [22]:
#DS job By Industry

salary_df.groupby('Company_Industry')["Job_Type"].count()

Company_Industry
Aerospace and Defense                127
Agriculture and Extraction            18
Auto                                  42
Banks and Financial Services         455
Computers and Electronics             99
Construction                          14
Consulting and Business Services     708
Consumer Goods and Services          103
Education and Schools                108
Energy and Utilities                  45
Food and Beverages                    19
Government                            61
Health Care                          304
Human Resources and Staffing          73
Industrial Manufacturing             148
Insurance                            250
Internet and Software                620
Media, News and Publishing            95
Missln                              1499
Organization                          22
Pharmaceuticals                       53
Real Estate                           26
Restaurants, Travel and Leisure       45
Retail                               119
Telecommunications                    71
Transport and Freight                 42
Name: Job_Type, dtype: int64

In [23]:
salary_df.groupby('Location')["Job_Type"].count()

Location
AL          16
AR          27
AZ          48
CA        1321
CO         104
CT          73
DC         131
DE          16
FL          99
GA         127
HI           6
IA          30
ID           6
IL         228
IN          42
KS           9
KY          12
LA           6
MA         245
MD         163
ME          13
MI          81
MN          62
MO          74
MT           1
NC         130
ND           1
NE          10
NH           7
NJ         121
NM           4
NV          17
NY         574
OH          99
OK           4
OR          56
PA         130
REMOTE      11
RI           7
SC          23
SD           1
TN          43
TX         312
USA         68
UT          34
VA         323
VT           2
WA         207
WI          37
WV           3
WY           2
Name: Job_Type, dtype: int64

In [24]:
# DS salary by job type

salary_df.groupby("Job_Type")['Queried_Salary'].value_counts()

Job_Type        Queried_Salary
data_analyst    <80000            617
                80000-99999       548
                100000-119999     277
                >160000            72
                120000-139999      67
                140000-159999      45
data_engineer   120000-139999     340
                100000-119999     319
                140000-159999     212
                80000-99999        85
                >160000            85
                <80000             24
data_scientist  120000-139999     758
                100000-119999     692
                140000-159999     545
                80000-99999       225
                >160000           211
                <80000             44
Name: Queried_Salary, dtype: int64

In [25]:
# DS salary by skill

salary_df.groupby("Job_Type")['Python'].value_counts()

Job_Type        Python
data_analyst              1114
                True       512
data_engineer   True       682
                           383
data_scientist  True      1895
                           580
Name: Python, dtype: int64

In [26]:
salary_df.groupby("Job_Type")['Machine_Learning'].value_counts()

Job_Type        Machine_Learning
data_analyst                        1599
                True                  27
data_engineer                       1049
                True                  16
data_scientist                      2226
                True                 249
Name: Machine_Learning, dtype: int64

In [27]:
salary_df.groupby("Job_Type")['R'].value_counts()

Job_Type        R
data_analyst            1564
                True      62
data_engineer           1046
                True      19
data_scientist          2450
                True      25
Name: R, dtype: int64

In [28]:
salary_df.groupby("Job_Type")['Hadoop'].value_counts()

Job_Type        Hadoop
data_analyst              1618
                True         8
data_engineer             1029
                True        36
data_scientist            2466
                True         9
Name: Hadoop, dtype: int64

In [29]:
salary_df.groupby("Job_Type")['SQL'].value_counts()

Job_Type        SQL
data_analyst             958
                True     668
data_engineer            792
                True     273
data_scientist          2291
                True     184
Name: SQL, dtype: int64

In [30]:
salary_df.groupby("Job_Type")["Tableau"].value_counts()

Job_Type        Tableau
data_analyst               1566
                True         60
data_engineer              1064
                True          1
data_scientist             2455
                True         20
Name: Tableau, dtype: int64

In [31]:
# trying to get skill by job type through single df ### not working

jobtype_skil_df=salary_df.groupby("Job_Type")[['Python','SQL','Machine_Learning',"R",'Hadoop',"Tableau"]]
print(jobtype_skil_df)

jobtype_skil_df.fillna('False', inplace=True)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000000000D0A7608>

Empty DataFrame
Columns: []
Index: []

In [32]:
# JObs by ["Company_Industry"], Location

group_salary_location=salary_df.groupby(['Location',"Company_Industry"])
group_salary_location["Job_Type"].count()

Location  Company_Industry
AL        Aerospace and Defense               4
          Banks and Financial Services        1
          Construction                        1
          Consulting and Business Services    2
          Industrial Manufacturing            1
                                             ..
WV        Aerospace and Defense               1
          Consulting and Business Services    1
          Missln                              1
WY        Media, News and Publishing          1
          Missln                              1
Name: Job_Type, Length: 538, dtype: int64

In [33]:
# salary by lication and industry
group_location_industry=salary_df.groupby(["Location","Company_Industry"])["Queried_Salary"].value_counts()
group_location_industry

Location  Company_Industry                  Queried_Salary
AL        Aerospace and Defense             80000-99999       4
          Banks and Financial Services      100000-119999     1
          Construction                      100000-119999     1
          Consulting and Business Services  120000-139999     2
          Industrial Manufacturing          80000-99999       1
                                                             ..
WV        Aerospace and Defense             80000-99999       1
          Consulting and Business Services  100000-119999     1
          Missln                            80000-99999       1
WY        Media, News and Publishing        100000-119999     1
          Missln                            80000-99999       1
Name: Queried_Salary, Length: 1345, dtype: int64

In [36]:
salary_df.groupby("Location")['Queried_Salary'].value_counts()

Location  Queried_Salary
AL        80000-99999       7
          100000-119999     5
          120000-139999     3
          <80000            1
AR        100000-119999     9
                           ..
WI        <80000            6
WV        80000-99999       2
          100000-119999     1
WY        100000-119999     1
          80000-99999       1
Name: Queried_Salary, Length: 230, dtype: int64